In [1]:
import pandas as pd

In [ ]:
seq_data=[10,20,30,40,50]

In [ ]:
s1=pd.Series(seq_data)
s1

In [ ]:
s2=pd.Series(['a','b',4,5])
s2

In [ ]:
list(s1.index)

In [ ]:
list(s2.values)

In [ ]:
index_sq2=pd.date_range(start="2020-01-03",end="2020-01-07")
s4=pd.Series(seq_data,index=index_sq2)
s4

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [3]:
import pandas as pd
df = pd.read_excel('./data/학생시험성적.xlsx')
df

  학생  국어  영어  수학         평균
0  A  80  90  85  85.000000
1  B  90  95  95  93.333333
2  C  95  70  75  80.000000
3  D  70  85  80  78.333333
4  E  75  90  85  83.333333

In [5]:
pd.read_excel('./data/학생시험성적.xlsx', sheet_name = 1)

  학생  과학  사회   역사         평균
0  A  90  95   85  90.000000
1  B  85  90   80  85.000000
2  C  70  80   75  75.000000
3  D  75  90  100  88.333333
4  E  90  80   90  86.666667